---
kind: type
id: T:Autodesk.Revit.UI.ComboBox
source: html/a5667995-e628-13df-c157-39c95b2435d6.htm
---
# Autodesk.Revit.UI.ComboBox

This class represents a selection control with a drop-down list that can be shown or hidden by clicking the arrow.

## Syntax (C#)
```csharp
public class ComboBox : RibbonItem
```

## Remarks
The order of items shown in the ComboBox depends upon the order which they were added, unless the ComboBoxMembers have been assigned to groups.
If the members have been assigned groups, they will be sorted to fall under their groups regardless of the order in which they were added.
Use of this class is not supported in Revit Macros.